;Place localized text in this file
[Operative X2SoldierClassTemplate]
DisplayName="XCOM Operative"
ClassSummary="Highly trained XCOM Operators for high risk missions."
LeftAbilityTreeTitle="Offensive"
RightAbilityTreeTitle="Defensive"

[X2Ability_GrenadierAbilitySet]
SuppressionTargetEffectDesc="Suppressed! Suffering <GWTSuppression:SUPPRESSIONPENALTY/> penalty to aim, and will be shot if attempting to move."
SuppressionSourceEffectDesc="Currently suppressing a target."

[Suppression X2AbilityTemplate]
LocFriendlyName="Suppression"
LocLongDescription="Fire a barrage that pins down a target, granting reaction fire against it if it moves, and imposing a <GWTSuppression:SUPPRESSIONPENALTY/> penalty to the target's aim."
LocHelpText="Penalize target's aim and shoot them if they move."
LocFlyOverText="Suppression"
LocPromotionPopupText="<Bullet/> Suppression costs <Ability:SelfAmmoCost/> ammo points to use, but has no cooldown.<br/><Bullet/> Suppression will be canceled if the suppressing unit is damaged.<br/><Bullet/> If multiple units suppress a target, the aim penalty will stack.<br/>"